;Photobooth
[X2Photobooth]
+m_arrAnimationSparkPoses=(AnimationDisplayName="Gun Down (MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="Gun Up (MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="Laid Back (MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="At Attention (MEC)")
+m_arrAnimationSparkPoses=(AnimationDisplayName="Arms at Sides (MEC)")




;Tech
[RM_MecAugmentation X2TechTemplate]
DisplayName="MEC Trooper Augmentation"
Summary="I found something digging through my dad's old files, something about more desperate measures if the automated SPARK design couldn't be implemented in time. It was a project involving the fusion of man and machine, and hopefully in a way that would allow the volunteer to live a life post-invasion. With the medical advancements brought by the aliens, I think we could make a worthy successor, one that would ask a bit less of those who volunteer, but give them way more firepower." 


;Facility Upgrade
[RM_MecFoundry X2FacilityUpgradeTemplate]
DisplayName="MEC Foundry"
FacilityName="Proving Ground"
Summary="Unlock the ability to create MEC Troopers."


;staff slot
[RM_MecAugmentationStaffSlot X2StaffSlotTemplate]
EmptyText="OPEN: SOLDIER REQUIRED"
BonusEmptyText="Augment a soldier to become a MEC Trooper."
BonusText="AUGMENTING"
FilledText="%UNITNAME is being augmented!"
LockedText="LOCKED: PURCHASE UPGRADE"


;bit abilities for MECs

[MecRocketLauncher X2AbilityTemplate]
LocFriendlyName="Rocket Launcher"
LocHelpText="Fire a rocket at target area."

[MecShredderGun X2AbilityTemplate]
LocFriendlyName="Fire Shredder Gun"
LocHelpText="Fire your Shredder Gun at a cone-shaped area."

[MecShredstormCannon X2AbilityTemplate]
LocFriendlyName="Shredstorm Cannon"
LocHelpText="Fire your Shredstorm Cannon."

[MecFlamethrower X2AbilityTemplate]
LocFriendlyName="Fire Flamethrower"
LocHelpText="Spray flames in a cone-shaped area."

[MecFlamethrowerMk2 X2AbilityTemplate]
LocFriendlyName="Hellfire Projector"
LocHelpText="Spray flames in a cone-shaped area."

[MecBlasterLauncher X2AbilityTemplate]
LocFriendlyName="Blaster Bomb"
LocHelpText="Fire a guided Blaster Bomb at a target area."

[MecPlasmaBlaster X2AbilityTemplate]
LocFriendlyName="Plasma Blaster"
LocHelpText="Fire your Plasma Blaster."

;class abilities
[RM_AbsorptionFields X2AbilityTemplate]
LocFriendlyName="Absorption Fields"
LocLongDescription="If an attack would exceed <Ability:RMAbsorption/>% of a MEC's maximum health, it gets limited to that percentage, or 1 if it would go below 0."
LocHelpText="Cap incoming attack damage to a certain percentage of the unit's current HP."
LocFlyOverText="Absorption Fields"
LocPromotionPopupText="<Bullet/>Allows MECs lagging on armour to still be competitive in the battlefield.<br/>"

[RM_ReactiveTargetingSensors X2AbilityTemplate]
LocFriendlyName="Reactive Targeting Sensors"
LocLongDescription="Any time an enemy fires on the MEC, the MEC will fire back as long as it has ammo remaining."
LocHelpText="React to attacks on the unit with returning fire."
LocFlyOverText="Reactive Targeting Sensors"
LocPromotionPopupText="<Bullet/>This perk, combined with more defensive perks, can enable a MEC to lock down an area without needing to go into overwatch directly.<br/>"

[RM_BrutalizeProtocol X2AbilityTemplate]
LocFriendlyName="Brutalize Protocol"
LocLongDescription="Attack an organic enemy with a overclocked punch, causing massive damage to it and forcing any organic target witnessing the <Ability:ClassName/> to panic. Causes a melee damage reduction for rest of the mission."
LocHelpText="Kill a given organic target, and force other organic targets in LOS to panic."
LocPromotionPopupText="<Bullet/>Brutalize Protocol has one charge per mission. Time it wisely to avoid suffering from the melee damage reduction for too long.<br/>"

[RM_BrutalizeBlowback X2AbilityTemplate]
LocFriendlyName="Damaged Arm"
LocLongDescription="This arm has been damaged by a MEC's overclocked melee attack, causing a -<Ability:BrutalizeBlowback/> point damage reduction in melee attacks."
LocHelpText="This arm has been damaged by a MEC's overclocked melee attack, causing a -<Ability:BrutalizeBlowback/> point damage reduction in melee attacks."


[RM_InTheZone X2AbilityTemplate]
LocFriendlyName="In The Zone"
LocLongDescription="Killing a flanked or otherwise uncovered target with your <Ability:WeaponName/> refunds the action points spent. Does not work with certain abilities."
LocHelpText="Restore action points when killing a flanked/uncovered target."
LocFlyOverText="In The Zone"
LocPromotionPopupText="<Bullet/>Run and Gun and Overclock Core will not let In The Zone function.<br/>"

[RM_HardenedCore X2AbilityTemplate]
LocFriendlyName="Resilience Core"
LocLongDescription="The MEC trooper gets equipped with super hardened internals, making it immune to critical hits."
LocHelpText="Immune to critical hits."
LocFlyOverText="Resilence Core"
LocPromotionPopupText="<Bullet/>A MEC trooper can go a long way when it doesn't have to worry about surprise crits.<br/>"

[RM_OverclockCore X2AbilityTemplate]
LocFriendlyName="Overclock Core"
LocLongDescription="The MEC trooper now has access over their internal systems, and can choose to ignore safety limits in exchange for an all out attack on all visible targets that will make them vulnerable afterwards."
LocHelpText="Go all-out against everything in sight (until you run out of ammo), and then shut down for a turn afterwards."
LocFlyOverText="Overclock Core"
LocPromotionPopupText="<Bullet/> Overclock Core requires <Ability:SelfAmmoCost/> ammo points and has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> Overclock Core is powerful when combined with aim enhancers or expanded magazines to maximize firepower, but will leave the MEC vulnerable to enemy fire in the next turn.<br/>"

[RM_OverheatTrigger X2AbilityTemplate]
LocFriendlyName="Overheating"
LocLongDescription="The usage of Overclock Core has resulted in this MEC's armour shutting down from the excess heat. The MEC is stunned, or loses -50 aim if the stun effect is somehow mitigated."
LocHelpText="MEC is either unable to act or has extremely poor aim for this turn."
LocFlyOverText="Overheating!"


[RM_RepairProtocol X2AbilityTemplate]
LocFriendlyName="Repair Servos"
LocLongDescription="The MEC trooper gets equipped with an internal version of the BIT's self-repair protocol, allowing it to regenerate some HP per turn to a given limit."
LocHelpText="Regenerate some HP per turn, up to a limit."
LocFlyOverText="Repair Servos"
LocPromotionPopupText="<Bullet/>The limit is initially +<Ability:RepairProtocol/> per mission, but increases with the MEC's armor level.<br/>"

[RM_MecSteadfast X2AbilityTemplate]
LocFriendlyName="Steadfast"
LocLongDescription="The unit grows steadfast against the horror of combat, and becomes immune to panicking."
LocHelpText="Immune to panic."
LocFlyOverText="Steadfast"
LocPromotionPopupText="<Bullet/>Can help when the unit is tired or otherwise may suffer panic effects from various sources.<br/>"

[RM_SharpArms X2AbilityTemplate]
LocFriendlyName="Sharpshooter Armature"
LocLongDescription="The MEC trooper gets its arms modified to be more stable, and allows a MEC trooper to hit hard, full cover targets with additional aim and crit."
LocHelpText="Gain bonus aim and crit against targets in full cover."
LocFlyOverText="Sharpshooter Armature"
LocPromotionPopupText="<Bullet/>Useful when combined with Overwatch: targets running from full cover will be easier to hit.<br/>"



[RM_MecDmgControl X2AbilityTemplate]
LocFriendlyName="Damage Control"
LocLongDescription="The MEC trooper gains +<Ability:MecDmgControl/> armor every time it is hit by an enemy. This effect refreshes every time it occurs."
LocHelpText="Gain armour upon being successfully attacked by an enemy."
LocFlyOverText="Damage Control"
LocPromotionPopupText="<Bullet/>Damage Control can greatly increase a low rank MEC trooper's survivability, or enhance a high rank MEC trooper.<br/>"

[RM_HammerProtocol X2AbilityTemplate]
LocFriendlyName="Hammer Protocol"
LocLongDescription="The MEC trooper gets anti-melee optimizations, gaining a 50% resistance to melee attacks and an immunity to unconciousness."
LocHelpText="Become resistant against melee attacks and immune to being knocked out."
LocFlyOverText="Hammer Protocol"
LocPromotionPopupText="<Bullet/>This ability helps the MEC trooper deal with some of their remaining weaknesses that weren't augmented out.<br/>"

[RM_SelfDefenceProtocol X2AbilityTemplate]
LocFriendlyName="Self Defence Protocol"
LocLongDescription="Free fist attacks on any enemies that enter or attack from melee range."
LocHelpText="Free fist attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Self Defence Protocol"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, SDP will trigger if that enemy tries to attack the <Ability:ClassName/>.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then SDP will trigger when that enemy moves into melee range.<br/>"

[SDPAttack X2AbilityTemplate]
LocFriendlyName="Self Defence Protocol"
LocLongDescription="Free fist attacks on any enemies that enter or attack from melee range."
LocHelpText="Free fist attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Self Defence Protocol"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, SDP will trigger if that enemy tries to attack the <Ability:ClassName/>.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then SDP will trigger when that enemy moves into melee range.<br/>"

[RM_CollateralDamage X2AbilityTemplate]
LocFriendlyName="Collateral Damage"
LocLongDescription="Unleash a volley of bullets at a target location, significantly damaging the environment in it. Deals minor damage to any targets inside."
LocHelpText="Fire at a target location, significantly damaging or destroying it. Deals minor damage to your target(s)."
LocFlyOverText="Collateral Damage"
LocPromotionPopupText="<Bullet/> Collateral Damage requires <Ability:SelfAmmoCost/> ammo points and has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> Collateral Damage does increased environmental damage, and will destroy most cover objects.<br/>"
LocMissMessage="Missed!"

[RM_KineticStrike X2AbilityTemplate]
LocFriendlyName="Kinetic Strike"
LocLongDescription="Attack any enemy within range with your MEC fist."
LocHelpText="Attack an enemy within range with your MEC fist."
LocPromotionPopupText="<Bullet/> It lacks the range of XCOM's other melee attacks, but Kinetic Strike makes up for it with much larger damage and costing one action point without ending the turn.<br/>"



[RM_ReactiveArmor X2AbilityTemplate]
LocFriendlyName="Reactive Armor"
LocLongDescription="The <Ability:ClassName/>'s armor now includes layers of reactive plating, granting bonus points of armour that scales with the <Ability:ClassName/>'s armor tech level."
LocHelpText="Gain additional armour depending on armor tech level."
LocFlyOverText="Reactive Armor"
LocPromotionPopupText="<Bullet/> While lacking Blast Padding's explosive protection, Reactive Armor makes up for it by enabling the <Ability:ClassName/> to carry Sectopod-grade armour with advanced technology.<br/>"

[RM_AdvancedFireControl X2AbilityTemplate]
LocFriendlyName="Advanced Fire Control"
LocLongDescription="The MEC trooper's arms is equipped with specialized targeting gear that enables faster and more efficient acquisition of targets, giving it <Ability:AFC/>% of the MEC's aim on reaction shots."
LocHelpText="Gain additional aim on reaction shots."
LocFlyOverText="Advanced Fire Control"
LocPromotionPopupText="<Bullet/> Advanced Fire Control can make Overwatch-specialized MECs a deadly force as long as they have bullets left in their gun.<br/>"

[RM_RelocationServos X2AbilityTemplate]
LocFriendlyName="Relocation Servos"
LocLongDescription="The MEC trooper's body is equipped with specialized leg servos that gain energy from the recoil of shots, enabling it to relocate after taking a normal shot."
LocHelpText="Gain a bonus movement point after taking a normal shot."
LocFlyOverText="Relocation Servos"
LocPromotionPopupText="<Bullet/> Relocation Servos allows a MEC trooper to shoot and then move, making more risky tactics safer.<br/>"

[RM_RelocationServosPassive X2AbilityTemplate]
LocFriendlyName="Relocation Servos"
LocLongDescription="The MEC trooper's body is equipped with specialized leg servos that gain energy from the recoil of shots, enabling it to relocate after taking a normal shot."
LocHelpText="Gain a bonus movement point after taking a normal shot."
LocFlyOverText="Relocation Servos"
LocPromotionPopupText="<Bullet/> Relocation Servos allows a MEC trooper to shoot and then move, making more risky tactics safer.<br/>"


;squaddie abilities
[RM_BodyShield X2AbilityTemplate]
LocFriendlyName="Body Shield"
LocLongDescription="The MEC generates a shield against the nearest visible target, granting defences against them."
LocHelpText="The nearest visible target has a lesser chance to hit and crit against the MEC."
LocFlyOverText="Body Shield"
LocPromotionPopupText="<Bullet/> Body Shield does not function against the Lost.<br/>"

[RM_ShockAbsorbers X2AbilityTemplate]
LocFriendlyName="Shock Absorbers"
LocLongDescription="The <Ability:ClassName/> takes <Ability:ShockAbsorbers/>% less damage from targets in a <Ability:ShockAbsorb_Range/> tile range or less."
LocHelpText="The <Ability:ClassName/> takes less damage from targets in close range."
LocFlyOverText="Shock Absorbers"

[RM_MecTaunt X2AbilityTemplate]
LocFriendlyName="Taunt"
LocLongDescription="The MEC taunts the enemy, marking itself, but also increasing its dodge by +<Ability:TauntDodge/>."
LocHelpText="The MEC makes themselves a target, and gives them more dodge."
LocFlyOverText="Taunt"
LocPromotionPopupText="<Bullet/> The mark effect will make the MEC a high priority target: be careful of how many enemies will target the MEC.<br/>"

;random deck abilities
[RM_ExtraConditioning X2AbilityTemplate]
LocFriendlyName="Cybernetic Conditioning"
LocLongDescription="The unit has conditioned themselves for combat, granting themselves extra HP that scales with their equipped armor."
LocHelpText="Gain additional HP at the start of a mission."
LocFlyOverText="Cybernetic Conditioning"
LocPromotionPopupText="<Bullet/> Cybernetic Conditioning can be a lifesaver in the tactical field. However, the HP it provides still counts for wound times.<br/>"

[RM_MecSprinter X2AbilityTemplate]
LocFriendlyName="Charger"
LocLongDescription="The unit has trained to gain +<Ability:MecSprinter/> mobility in the field."
LocHelpText="Gain additional mobility at the start of a mission."
LocFlyOverText="Charger"
LocPromotionPopupText="<Bullet/> Charger, when combined with other mobility enhancements, can allow for some extreme flanks not normally possible.<br/>"

[ShadowOps_DangerZone X2AbilityTemplate]
LocFriendlyName="Devastation"
LocLongDescription="The radius of your grenades and rockets is increased by 2, and the radius of your Breach and Collateral Damage abilities are increased by 1."
LocHelpText="The radius of your grenades and rockets is increased by 2, and the radius of your Breach and Collateral Damage abilities are increased by 1."
LocFlyOverText="Devastation"
LocPromotionPopupText="<Bullet/> Devastation provides a massive increase to grenade radius that makes it easy to hit multiple units and remove their cover, not to mention all other cover nearby. <br/>"

[Supernova X2AbilityTemplate]
LocFriendlyName="Supernova"
LocLongDescription="Dash to a location and overload the <Ability:ClassName/>'s reactor, dealing immense damage to all nearby units. The <Ability:ClassName/> will be stunned for 1 turn."
LocHelpText="Dash to a location and overload the <Ability:ClassName/>'s reactor, dealing immense damage to all nearby units. The <Ability:ClassName/> will be stunned for 1 turn."
LocPromotionPopupText="<Bullet/> Overload the <Ability:ClassName/>'s reactor, flooding the area with lethal radiation that rips apart organics and corrupts the computer memory of robotics. The <Ability:ClassName/> must shut down for a time after the blast in order to recover from the energies unleashed.<br/><Bullet/> Supernova has one charge per mission.<br/><Bullet/> The <Ability:ClassName/> can combine a move and Supernova into a single action (or two for a dash).<br/><Bullet/> All nearby robotic enemies will be stunned for two action points.<br/>"

[Nova X2AbilityTemplate]
LocFriendlyName="Nova"
LocLongDescription="Release a blast of energy, damaging all nearby units. This attack has no cost or cooldown, but consecutive Novas will damage the <Ability:ClassName/>."
LocHelpText="Blast all nearby units. Consecutive Novas will damage the <Ability:ClassName/>."
LocPromotionPopupText="<Bullet/> Nova has no action point cost and no cooldown.<br/><Bullet/> The first Nova attack each mission will deal 0 damage to the <Ability:ClassName/>.<br/><Bullet/> All Nova attacks after the first will deal a stacking <Ability:Nova_Damage/> damage to the <Ability:ClassName/>.<br/>"


;character template
[XComMECSoldier X2CharacterTemplate]
strCharacterName="MEC Trooper"
strCharacterBackgroundMale[0]="Raised in a remote community in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> learned the art of survival at an early age. Instilled with a strong sense of self-reliance, he's eager to do his part to take back the Earth."
strCharacterBackgroundMale[1]="People say <XGParam:StrValue1/!FirstName/> lost it and went rogue after learning that Earth's governments had surrendered to the aliens. The prevailing rumor is that he's spent most of his time since in <XGParam:StrValue0/!CountryName/>, hunting aliens for sport."
strCharacterBackgroundMale[2]="<XGParam:StrValue1/!FirstName/> was was separated from his family during the invasion. He wound up fighting his way across <XGParam:StrValue0/!CountryName/>, apparently surviving on his own for the past several years."
strCharacterBackgroundMale[3]="Born and raised in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> is something of a wild card, with no formal training to speak of. He may be just the kind of recruit XCOM needs."
strCharacterBackgroundMale[4]="Word circulating among the troops is that <XGParam:StrValue1/!FirstName/> was actually a convict being held in <XGParam:StrValue0/!CountryName/> until recently. Since his release, he's developed a grisly reputation for collecting trophies off of enemy combatants."
strCharacterBackgroundMale[5]="<XGParam:StrValue1/!FirstName/> carries himself like a military veteran, but has been reluctant to speak about the details of his past service in <XGParam:StrValue0/!CountryName/>. C.O. Bradford note: let sleeping dogs lie."
strCharacterBackgroundMale[6]="Serving as part of an irregular militia outfit in <XGParam:StrValue0/!CountryName/> known simply as the Warriors, <XGParam:StrValue1/!FirstName/> was wounded and later captured by ADVENT. We're not entirely sure why he wasn't processed with the other prisoners." 
strCharacterBackgroundMale[7]="Back in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> is the subject of longstanding rumors as to his involvement in covert military operations. He'll have plenty of opportunities to prove himself in the coming weeks." 
strCharacterBackgroundMale[8]="There are concerns among the Resistance regarding speculation that several recent recruits may have actually been escapees from a high-security prison facility in <XGParam:StrValue0/!CountryName/>. <XGParam:StrValue1/!FirstName/> is on their list of possible detainees, but at this point, we're not in a position to turn away skilled fighters regardless of where they've been."
strCharacterBackgroundMale[9]="<XGParam:StrValue1/!FirstName/> was caught by alien forces outside of one of the city centers in <XGParam:StrValue0/!CountryName/>. Using a stolen vehicle, he apparently rammed one of the ADVENT security towers in the hopes of uprooting it. Obviously it didn't work out, but we like his instincts."  
strCharacterBackgroundFemale[0]="Raised in a remote community in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> learned the art of survival at an early age. Instilled with a strong sense of self-reliance, she's eager to do her part to take back the Earth."
strCharacterBackgroundFemale[1]="People say <XGParam:StrValue1/!FirstName/> lost it and went rogue after learning that Earth's governments had surrendered to the aliens. The prevailing rumor is that she's spent most of her time since in <XGParam:StrValue0/!CountryName/>, hunting aliens for sport."
strCharacterBackgroundFemale[2]="<XGParam:StrValue1/!FirstName/> was separated from her family during the invasion. She wound up fighting her way across <XGParam:StrValue0/!CountryName/>, apparently surviving on her own for the past several years."
strCharacterBackgroundFemale[3]="Born and raised in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> is something of a wild card, with no formal training to speak of. She may be just the kind of recruit XCOM needs." 
strCharacterBackgroundFemale[4]="Word circulating among the troops is that <XGParam:StrValue1/!FirstName/> was actually a convict being held in <XGParam:StrValue0/!CountryName/> until recently. Since her release, she's developed a grisly reputation for collecting trophies off of enemy combatants." 
strCharacterBackgroundFemale[5]="<XGParam:StrValue1/!FirstName/> carries herself like a military veteran, but has been reluctant to speak about the details of her past service in <XGParam:StrValue0/!CountryName/>. C.O. Bradford note: let sleeping dogs lie."
strCharacterBackgroundFemale[6]="Serving as part of an irregular militia outfit in <XGParam:StrValue0/!CountryName/> known simply as the Warriors, <XGParam:StrValue1/!FirstName/> was wounded and later captured by ADVENT. We're not entirely sure why she wasn't processed with the other prisoners." 
strCharacterBackgroundFemale[7]="Back in <XGParam:StrValue0/!CountryName/>, <XGParam:StrValue1/!FirstName/> is the subject of longstanding rumors as to her involvement in covert military operations. She'll have plenty of opportunities to prove herself in the coming weeks." 
strCharacterBackgroundFemale[8]="There are concerns among the Resistance regarding speculation that several recent recruits may have actually been escapees from a high-security prison facility in <XGParam:StrValue0/!CountryName/>. <XGParam:StrValue1/!FirstName/> is on their list of possible detainees, but at this point, we're not in a position to turn away skilled fighters regardless of where they've been."
strCharacterBackgroundFemale[9]="<XGParam:StrValue1/!FirstName/> was caught by alien forces outside of one of the city centers in <XGParam:StrValue0/!CountryName/>. Using a stolen vehicle, she apparently rammed one of the ADVENT security towers in the hopes of uprooting it. Obviously it didn't work out, but we like her instincts." 



;class text
[RM_DefaultMecTrooper X2SoldierClassTemplate]
DisplayName="MEC Support"
ClassSummary="A mix of human and machine, MEC Supports specialize in hacking Advent systems or mechanical units as well as providing covering fire."
LeftAbilityTreeTitle="Reprogram"
RightAbilityTreeTitle="Pressure"

AbilityTreeTitles[0]="Reprogram"
AbilityTreeTitles[1]="Guardian"
AbilityTreeTitles[2]="Pressure"
AbilityTreeTitles[3]="Medical"


RandomNickNames[0]="Rook"
RandomNickNames[1]="Bishop"
RandomNickNames[2]="Dragoon"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="Hoplite"
RandomNickNames[5]="Centurion"
RandomNickNames[6]="Praetorian"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="Vector"
RandomNickNames[10]="Titan"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="Rapier"
RandomNickNames[14]="Morningstar"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="Halberd"
RandomNickNames[17]="Javelin"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="Masamune"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="Gungnir"
RandomNickNames[22]="Mjolnir"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="Scimitar"
RandomNickNames[25]="Trident"
RandomNickNames[26]="Scythe"
RandomNickNames[27]="Giga"
RandomNickNames[28]="Malware"
RandomNickNames[29]="Devastator"
RandomNickNames[30]="Terminator"
RandomNickNames[31]="Rust Bucket"
RandomNickNames[32]="Crushinator"
RandomNickNames[33]="Guardian"
RandomNickNames[34]="Junkyard"
RandomNickNames[35]="Scraps"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Big Daddy"
RandomNickNames_Male[1]="Ironman"
RandomNickNames_Male[2]="Forklift"
RandomNickNames_Male[3]="Golem"
RandomNickNames_Male[4]="Caliban"
RandomNickNames_Male[5]="Duke"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"
RandomNickNames_Female[6]="Big Sister"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His fist, their broken bones!"
PhotoboothSoloBLines_Male[1]="This bad boy can fit so many punches in it."
PhotoboothSoloBLines_Male[2]="This MEC kills aliens."
PhotoboothSoloBLines_Male[3]="He doesn't need cover."
PhotoboothSoloBLines_Male[4]="A cannon. His fists. All the aliens he can kill."

PhotoboothSoloBLines_Female[0]="Her fist, their broken bones!"
PhotoboothSoloBLines_Female[1]="This bad girl can fit so many punches in it."
PhotoboothSoloBLines_Female[2]="This MEC kills aliens."
PhotoboothSoloBLines_Female[3]="She doesn't need cover."
PhotoboothSoloBLines_Female[4]="A cannon. Her fists. All the aliens she can kill."

[RM_CannonMecTrooper X2SoldierClassTemplate]
DisplayName="MEC Heavy"
ClassSummary="A mix of human and machine, MEC Heavies specialize at dominating prolonged firefights, and are great at destroying cover."
LeftAbilityTreeTitle="Shogun"
RightAbilityTreeTitle="Goliath"

AbilityTreeTitles[0]="Shogun"
AbilityTreeTitles[1]="Valkyrie"
AbilityTreeTitles[2]="Goliath"
AbilityTreeTitles[3]="Fog Of War"


RandomNickNames[0]="Rook"
RandomNickNames[1]="Bishop"
RandomNickNames[2]="Dragoon"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="Hoplite"
RandomNickNames[5]="Centurion"
RandomNickNames[6]="Praetorian"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="Vector"
RandomNickNames[10]="Titan"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="Rapier"
RandomNickNames[14]="Morningstar"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="Halberd"
RandomNickNames[17]="Javelin"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="Masamune"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="Gungnir"
RandomNickNames[22]="Mjolnir"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="Scimitar"
RandomNickNames[25]="Trident"
RandomNickNames[26]="Scythe"
RandomNickNames[27]="Giga"
RandomNickNames[28]="Malware"
RandomNickNames[29]="Devastator"
RandomNickNames[30]="Terminator"
RandomNickNames[31]="Rust Bucket"
RandomNickNames[32]="Crushinator"
RandomNickNames[33]="Guardian"
RandomNickNames[34]="Junkyard"
RandomNickNames[35]="Scraps"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Big Daddy"
RandomNickNames_Male[1]="Ironman"
RandomNickNames_Male[2]="Forklift"
RandomNickNames_Male[3]="Golem"
RandomNickNames_Male[4]="Caliban"
RandomNickNames_Male[5]="Duke"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"
RandomNickNames_Female[6]="Big Sister"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His fist, their broken bones!"
PhotoboothSoloBLines_Male[1]="This bad boy can fit so many punches in it."
PhotoboothSoloBLines_Male[2]="This MEC kills aliens."
PhotoboothSoloBLines_Male[3]="He doesn't need cover."
PhotoboothSoloBLines_Male[4]="A cannon. His fists. All the aliens he can kill."

PhotoboothSoloBLines_Female[0]="Her fist, their broken bones!"
PhotoboothSoloBLines_Female[1]="This bad girl can fit so many punches in it."
PhotoboothSoloBLines_Female[2]="This MEC kills aliens."
PhotoboothSoloBLines_Female[3]="She doesn't need cover."
PhotoboothSoloBLines_Female[4]="A cannon. Her fists. All the aliens she can kill."


[RM_SniperMecTrooper X2SoldierClassTemplate]
DisplayName="MEC Sniper"
ClassSummary="A mix of human and machine, MEC Snipers specialize in accurate shooting from afar, as well as helping the rest of the squad hit their targets."
LeftAbilityTreeTitle="Spotter"
RightAbilityTreeTitle="Archer"

AbilityTreeTitles[0]="Spotter"
AbilityTreeTitles[1]="Jaeger"
AbilityTreeTitles[2]="Archer"
AbilityTreeTitles[3]="Catapult"


RandomNickNames[0]="Rook"
RandomNickNames[1]="Bishop"
RandomNickNames[2]="Dragoon"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="Hoplite"
RandomNickNames[5]="Centurion"
RandomNickNames[6]="Praetorian"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="Vector"
RandomNickNames[10]="Titan"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="Rapier"
RandomNickNames[14]="Morningstar"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="Halberd"
RandomNickNames[17]="Javelin"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="Masamune"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="Gungnir"
RandomNickNames[22]="Mjolnir"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="Scimitar"
RandomNickNames[25]="Trident"
RandomNickNames[26]="Scythe"
RandomNickNames[27]="Giga"
RandomNickNames[28]="Malware"
RandomNickNames[29]="Devastator"
RandomNickNames[30]="Terminator"
RandomNickNames[31]="Rust Bucket"
RandomNickNames[32]="Crushinator"
RandomNickNames[33]="Guardian"
RandomNickNames[34]="Junkyard"
RandomNickNames[35]="Scraps"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Big Daddy"
RandomNickNames_Male[1]="Ironman"
RandomNickNames_Male[2]="Forklift"
RandomNickNames_Male[3]="Golem"
RandomNickNames_Male[4]="Caliban"
RandomNickNames_Male[5]="Duke"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"
RandomNickNames_Female[6]="Big Sister"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His fist, their broken bones!"
PhotoboothSoloBLines_Male[1]="This bad boy can fit so many punches in it."
PhotoboothSoloBLines_Male[2]="This MEC kills aliens."
PhotoboothSoloBLines_Male[3]="He doesn't need cover."
PhotoboothSoloBLines_Male[4]="A cannon. His fists. All the aliens he can kill."

PhotoboothSoloBLines_Female[0]="Her fist, their broken bones!"
PhotoboothSoloBLines_Female[1]="This bad girl can fit so many punches in it."
PhotoboothSoloBLines_Female[2]="This MEC kills aliens."
PhotoboothSoloBLines_Female[3]="She doesn't need cover."
PhotoboothSoloBLines_Female[4]="A cannon. Her fists. All the aliens she can kill."



[RM_ShotgunMecTrooper X2SoldierClassTemplate]
DisplayName="MEC Assault"
ClassSummary="A mix of human and machine, MEC Assaults specialize in covering distance quickly and hitting enemies hard at close range."
LeftAbilityTreeTitle="Warrior"
RightAbilityTreeTitle="Pathfinder"

AbilityTreeTitles[0]="Warrior"
AbilityTreeTitles[1]="Marauder"
AbilityTreeTitles[2]="Pathfinder"
AbilityTreeTitles[3]="Titan"


RandomNickNames[0]="Rook"
RandomNickNames[1]="Bishop"
RandomNickNames[2]="Dragoon"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="Hoplite"
RandomNickNames[5]="Centurion"
RandomNickNames[6]="Praetorian"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="Vector"
RandomNickNames[10]="Titan"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="Rapier"
RandomNickNames[14]="Morningstar"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="Halberd"
RandomNickNames[17]="Javelin"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="Masamune"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="Gungnir"
RandomNickNames[22]="Mjolnir"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="Scimitar"
RandomNickNames[25]="Trident"
RandomNickNames[26]="Scythe"
RandomNickNames[27]="Giga"
RandomNickNames[28]="Malware"
RandomNickNames[29]="Devastator"
RandomNickNames[30]="Terminator"
RandomNickNames[31]="Rust Bucket"
RandomNickNames[32]="Crushinator"
RandomNickNames[33]="Guardian"
RandomNickNames[34]="Junkyard"
RandomNickNames[35]="Scraps"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Big Daddy"
RandomNickNames_Male[1]="Ironman"
RandomNickNames_Male[2]="Forklift"
RandomNickNames_Male[3]="Golem"
RandomNickNames_Male[4]="Caliban"
RandomNickNames_Male[5]="Duke"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"
RandomNickNames_Female[6]="Big Sister"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His fist, their broken bones!"
PhotoboothSoloBLines_Male[1]="This bad boy can fit so many punches in it."
PhotoboothSoloBLines_Male[2]="This MEC kills aliens."
PhotoboothSoloBLines_Male[3]="He doesn't need cover."
PhotoboothSoloBLines_Male[4]="A cannon. His fists. All the aliens he can kill."

PhotoboothSoloBLines_Female[0]="Her fist, their broken bones!"
PhotoboothSoloBLines_Female[1]="This bad girl can fit so many punches in it."
PhotoboothSoloBLines_Female[2]="This MEC kills aliens."
PhotoboothSoloBLines_Female[3]="She doesn't need cover."
PhotoboothSoloBLines_Female[4]="A cannon. Her fists. All the aliens she can kill."

[RM_ChemthrowerMecTrooper X2SoldierClassTemplate]
DisplayName="MEC Hellion"
ClassSummary="A mix of human and machine, MEC Hellions specialize in use of the Incinerator to annihilate or impair groups of enemies, and can carry a lot of Canister charges."
LeftAbilityTreeTitle="Meltdown"
RightAbilityTreeTitle="Hydra"

AbilityTreeTitles[0]="Meltdown"
AbilityTreeTitles[1]="Maniac"
AbilityTreeTitles[2]="Hydra"
AbilityTreeTitles[3]="Hazardous"


RandomNickNames[0]="Rook"
RandomNickNames[1]="Bishop"
RandomNickNames[2]="Dragoon"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="Hoplite"
RandomNickNames[5]="Centurion"
RandomNickNames[6]="Praetorian"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="Vector"
RandomNickNames[10]="Titan"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="Rapier"
RandomNickNames[14]="Morningstar"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="Halberd"
RandomNickNames[17]="Javelin"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="Masamune"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="Gungnir"
RandomNickNames[22]="Mjolnir"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="Scimitar"
RandomNickNames[25]="Trident"
RandomNickNames[26]="Scythe"
RandomNickNames[27]="Giga"
RandomNickNames[28]="Malware"
RandomNickNames[29]="Devastator"
RandomNickNames[30]="Terminator"
RandomNickNames[31]="Rust Bucket"
RandomNickNames[32]="Crushinator"
RandomNickNames[33]="Guardian"
RandomNickNames[34]="Junkyard"
RandomNickNames[35]="Scraps"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Big Daddy"
RandomNickNames_Male[1]="Ironman"
RandomNickNames_Male[2]="Forklift"
RandomNickNames_Male[3]="Golem"
RandomNickNames_Male[4]="Caliban"
RandomNickNames_Male[5]="Duke"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"
RandomNickNames_Female[6]="Big Sister"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His fist, their broken bones!"
PhotoboothSoloBLines_Male[1]="This bad boy can fit so many punches in it."
PhotoboothSoloBLines_Male[2]="This MEC kills aliens."
PhotoboothSoloBLines_Male[3]="He doesn't need cover."
PhotoboothSoloBLines_Male[4]="A cannon. His fists. All the aliens he can kill."

PhotoboothSoloBLines_Female[0]="Her fist, their broken bones!"
PhotoboothSoloBLines_Female[1]="This bad girl can fit so many punches in it."
PhotoboothSoloBLines_Female[2]="This MEC kills aliens."
PhotoboothSoloBLines_Female[3]="She doesn't need cover."
PhotoboothSoloBLines_Female[4]="A cannon. Her fists. All the aliens she can kill."

[RM_ShieldMecTrooper X2SoldierClassTemplate]
DisplayName="MEC Protector"
ClassSummary="A mix of human and machine, MEC Protectors specialize in use of a shield to block enemy attacks and keep the rest of the squad safe."
LeftAbilityTreeTitle="Fortification"
RightAbilityTreeTitle="Primal"

AbilityTreeTitles[0]="Fortification"
AbilityTreeTitles[1]="Door Kicker"
AbilityTreeTitles[2]="Primal"
AbilityTreeTitles[3]="Pain Train"


RandomNickNames[0]="Rook"
RandomNickNames[1]="Bishop"
RandomNickNames[2]="Dragoon"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="Hoplite"
RandomNickNames[5]="Centurion"
RandomNickNames[6]="Praetorian"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="Vector"
RandomNickNames[10]="Titan"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="Rapier"
RandomNickNames[14]="Morningstar"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="Halberd"
RandomNickNames[17]="Javelin"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="Masamune"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="Gungnir"
RandomNickNames[22]="Mjolnir"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="Scimitar"
RandomNickNames[25]="Trident"
RandomNickNames[26]="Scythe"
RandomNickNames[27]="Giga"
RandomNickNames[28]="Malware"
RandomNickNames[29]="Devastator"
RandomNickNames[30]="Terminator"
RandomNickNames[31]="Rust Bucket"
RandomNickNames[32]="Crushinator"
RandomNickNames[33]="Guardian"
RandomNickNames[34]="Junkyard"
RandomNickNames[35]="Scraps"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Big Daddy"
RandomNickNames_Male[1]="Ironman"
RandomNickNames_Male[2]="Forklift"
RandomNickNames_Male[3]="Golem"
RandomNickNames_Male[4]="Caliban"
RandomNickNames_Male[5]="Duke"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"
RandomNickNames_Female[6]="Big Sister"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His fist, their broken bones!"
PhotoboothSoloBLines_Male[1]="This bad boy can fit so many punches in it."
PhotoboothSoloBLines_Male[2]="This MEC kills aliens."
PhotoboothSoloBLines_Male[3]="He doesn't need cover."
PhotoboothSoloBLines_Male[4]="A cannon. His fists. All the aliens he can kill."

PhotoboothSoloBLines_Female[0]="Her fist, their broken bones!"
PhotoboothSoloBLines_Female[1]="This bad girl can fit so many punches in it."
PhotoboothSoloBLines_Female[2]="This MEC kills aliens."
PhotoboothSoloBLines_Female[3]="She doesn't need cover."
PhotoboothSoloBLines_Female[4]="A cannon. Her fists. All the aliens she can kill."

[RM_ReaperMecTrooper X2SoldierClassTemplate]
DisplayName="MEC Reaper"
ClassSummary="A mix of human and machine, MEC Reapers specialize in stealth and disrupting the enemy."
LeftAbilityTreeTitle="Stealth"
RightAbilityTreeTitle="Marksman"

AbilityTreeTitles[0]="Stealth"
AbilityTreeTitles[1]="Saboteur"
AbilityTreeTitles[2]="Marksman"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="Rook"
RandomNickNames[1]="Bishop"
RandomNickNames[2]="Dragoon"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="Hoplite"
RandomNickNames[5]="Centurion"
RandomNickNames[6]="Praetorian"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="Vector"
RandomNickNames[10]="Titan"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="Rapier"
RandomNickNames[14]="Morningstar"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="Halberd"
RandomNickNames[17]="Javelin"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="Masamune"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="Gungnir"
RandomNickNames[22]="Mjolnir"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="Scimitar"
RandomNickNames[25]="Trident"
RandomNickNames[26]="Scythe"
RandomNickNames[27]="Giga"
RandomNickNames[28]="Malware"
RandomNickNames[29]="Devastator"
RandomNickNames[30]="Terminator"
RandomNickNames[31]="Rust Bucket"
RandomNickNames[32]="Crushinator"
RandomNickNames[33]="Guardian"
RandomNickNames[34]="Junkyard"
RandomNickNames[35]="Scraps"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Big Daddy"
RandomNickNames_Male[1]="Ironman"
RandomNickNames_Male[2]="Forklift"
RandomNickNames_Male[3]="Golem"
RandomNickNames_Male[4]="Caliban"
RandomNickNames_Male[5]="Duke"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"
RandomNickNames_Female[6]="Big Sister"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His fist, their broken bones!"
PhotoboothSoloBLines_Male[1]="This bad boy can fit so many punches in it."
PhotoboothSoloBLines_Male[2]="This MEC kills aliens."
PhotoboothSoloBLines_Male[3]="He doesn't need cover."
PhotoboothSoloBLines_Male[4]="A cannon. His fists. All the aliens he can kill."

PhotoboothSoloBLines_Female[0]="Her fist, their broken bones!"
PhotoboothSoloBLines_Female[1]="This bad girl can fit so many punches in it."
PhotoboothSoloBLines_Female[2]="This MEC kills aliens."
PhotoboothSoloBLines_Female[3]="She doesn't need cover."
PhotoboothSoloBLines_Female[4]="A cannon. Her fists. All the aliens she can kill."



[RM_SkirmisherMecTrooper X2SoldierClassTemplate]
DisplayName="MEC Skirmisher"
ClassSummary="A mix of hybrid and machine, MEC Skirmishers specialize in front line combat and attacking relentlessly."
LeftAbilityTreeTitle="Hussar"
RightAbilityTreeTitle="Tactician"

AbilityTreeTitles[0]="Hussar"
AbilityTreeTitles[1]="Judge"
AbilityTreeTitles[2]="Tactician"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="Rook"
RandomNickNames[1]="Bishop"
RandomNickNames[2]="Dragoon"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="Hoplite"
RandomNickNames[5]="Centurion"
RandomNickNames[6]="Praetorian"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="Vector"
RandomNickNames[10]="Titan"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="Rapier"
RandomNickNames[14]="Morningstar"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="Halberd"
RandomNickNames[17]="Javelin"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="Masamune"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="Gungnir"
RandomNickNames[22]="Mjolnir"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="Scimitar"
RandomNickNames[25]="Trident"
RandomNickNames[26]="Scythe"
RandomNickNames[27]="Giga"
RandomNickNames[28]="Malware"
RandomNickNames[29]="Devastator"
RandomNickNames[30]="Terminator"
RandomNickNames[31]="Rust Bucket"
RandomNickNames[32]="Crushinator"
RandomNickNames[33]="Guardian"
RandomNickNames[34]="Junkyard"
RandomNickNames[35]="Scraps"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Big Daddy"
RandomNickNames_Male[1]="Ironman"
RandomNickNames_Male[2]="Forklift"
RandomNickNames_Male[3]="Golem"
RandomNickNames_Male[4]="Caliban"
RandomNickNames_Male[5]="Duke"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"
RandomNickNames_Female[6]="Big Sister"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His fist, their broken bones!"
PhotoboothSoloBLines_Male[1]="This bad boy can fit so many punches in it."
PhotoboothSoloBLines_Male[2]="This MEC kills aliens."
PhotoboothSoloBLines_Male[3]="He doesn't need cover."
PhotoboothSoloBLines_Male[4]="A cannon. His fists. All the aliens he can kill."

PhotoboothSoloBLines_Female[0]="Her fist, their broken bones!"
PhotoboothSoloBLines_Female[1]="This bad girl can fit so many punches in it."
PhotoboothSoloBLines_Female[2]="This MEC kills aliens."
PhotoboothSoloBLines_Female[3]="She doesn't need cover."
PhotoboothSoloBLines_Female[4]="A cannon. Her fists. All the aliens she can kill."

[RM_TemplarMecTrooper X2SoldierClassTemplate]
DisplayName="MEC Templar"
ClassSummary="A mix of human and machine, MEC Templars specialize in melee combat and electrical attacks with a GREMLIN. They also retain some degree of Psionic capability."
LeftAbilityTreeTitle="Power Fist"
RightAbilityTreeTitle="Sage"

AbilityTreeTitles[0]="Power Fist"
AbilityTreeTitles[1]="Dynamo"
AbilityTreeTitles[2]="Sage"
AbilityTreeTitles[3]="XCOM"


RandomNickNames[0]="Rook"
RandomNickNames[1]="Bishop"
RandomNickNames[2]="Dragoon"
RandomNickNames[3]="Myrmidon"
RandomNickNames[4]="Hoplite"
RandomNickNames[5]="Centurion"
RandomNickNames[6]="Praetorian"
RandomNickNames[7]="Saber"
RandomNickNames[8]="Jaeger"
RandomNickNames[9]="Vector"
RandomNickNames[10]="Titan"
RandomNickNames[11]="Claymore"
RandomNickNames[12]="Falchion"
RandomNickNames[13]="Rapier"
RandomNickNames[14]="Morningstar"
RandomNickNames[15]="Glaive"
RandomNickNames[16]="Halberd"
RandomNickNames[17]="Javelin"
RandomNickNames[18]="Sarissa"
RandomNickNames[19]="Masamune"
RandomNickNames[20]="Excalibur"
RandomNickNames[21]="Gungnir"
RandomNickNames[22]="Mjolnir"
RandomNickNames[23]="Gladius"
RandomNickNames[24]="Scimitar"
RandomNickNames[25]="Trident"
RandomNickNames[26]="Scythe"
RandomNickNames[27]="Giga"
RandomNickNames[28]="Malware"
RandomNickNames[29]="Devastator"
RandomNickNames[30]="Terminator"
RandomNickNames[31]="Rust Bucket"
RandomNickNames[32]="Crushinator"
RandomNickNames[33]="Guardian"
RandomNickNames[34]="Junkyard"
RandomNickNames[35]="Scraps"


;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Big Daddy"
RandomNickNames_Male[1]="Ironman"
RandomNickNames_Male[2]="Forklift"
RandomNickNames_Male[3]="Golem"
RandomNickNames_Male[4]="Caliban"
RandomNickNames_Male[5]="Duke"

;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"
RandomNickNames_Female[6]="Big Sister"

;ALPHABETICAL ORDER
PhotoboothSoloBLines_Male[0]="His fist, their broken bones!"
PhotoboothSoloBLines_Male[1]="This bad boy can fit so many punches in it."
PhotoboothSoloBLines_Male[2]="This MEC kills aliens."
PhotoboothSoloBLines_Male[3]="He doesn't need cover."
PhotoboothSoloBLines_Male[4]="A cannon. His fists. All the aliens he can kill."

PhotoboothSoloBLines_Female[0]="Her fist, their broken bones!"
PhotoboothSoloBLines_Female[1]="This bad girl can fit so many punches in it."
PhotoboothSoloBLines_Female[2]="This MEC kills aliens."
PhotoboothSoloBLines_Female[3]="She doesn't need cover."
PhotoboothSoloBLines_Female[4]="A cannon. Her fists. All the aliens she can kill."

[MecRend X2AbilityTemplate]
LocFriendlyName="Rending Punch"
LocLongDescription="A Strike attack against any target in movement range that grants a Momentum action point after the attack. Can be used once per turn. Damage is dependent on equipped chassis."
LocHelpText="Punch any target in movement range. Gain a Momentum action point after the attack."
LocPromotionPopupText="<Bullet/> You can trigger the Rending Punch ability by placing the movement cursor over an enemy.<br/><Bullet/> A MEC Templar can perform a \"Dash\" move, using both actions to move, and still trigger a Rending Punch against an adjacent enemy.<br/><Bullet/> Rending Punch will do 8/10/12 damage, depending on the equipped SPARK chassis.<br/><Bullet/> Rending Punch's chance to hit is based off the MEC Templar's aim with a +20 boost.<br/><Bullet/> Gain a Momentum action point after, which can be used to move.<br/><Bullet/> Can be used once per turn.<br/>"

[OneTwoPunch X2AbilityTemplate]
LocFriendlyName="One-Two Punch"
LocLongDescription="A Strike attack that only does half damage and can't be used with movement, but uses a Momentum action point rather than a standard one. Can be used once per turn."
LocHelpText="Punch an adjacent target for half damage instead of moving. Requires a Momentum action point."
LocPromotionPopupText="<Bullet/> One-Two Punch is an excellent way to finish an enemy after an unlucky graze, or one that simply has a lot of health.<br/><Bullet/> If you position yourself just right, you can direct your One-Two Punch against a different nearby enemy rather than your Rending Punch target.<br/><Bullet/> Only usable with the Momentum action point granted following a Rending Punch attack and can be used once per turn.<br/>"

[DeepMist X2AbilityTemplate]
LocFriendlyName="Deep Mist"
LocLongDescription="The Restorative Mist item gains 2 extra charges."
LocHelpText=The Restorative Mist item gains 2 extra charges."
LocPromotionPopupText="<Bullet/> The Restorative Mist bonus charges only affect the carried item, not the ability of the same name. The bonus charges will work whether the Restorative Mist is being deployed with a BIT or not."

[MecTrooperImmunities X2AbilityTemplate]
LocFriendlyName="MEC Trooper Immunities"
LocLongDescription="All MEC Troopers are immune to fire, Chryssalid poison, Viper bind and knockback."
LocHelpText="All MEC Troopers are immune to fire, Chryssalid poison, Viper bind and knockback."
LocFlyOverText="MEC Trooper Immunities"

[MZChainingJolt X2AbilityTemplate]
LocFriendlyName="Chaining Jolt"
LocHelpText="Send the GREMLIN to an enemy to jolt them. Attack chains to nearby enemies."
LocLongDescription="The <Ability:ClassName/> sends the GREMLIN to an enemy to jolt them. Attack chains to nearby enemies. Damage is increased against robotic enemies."
LocFlyOverText="Chaining Jolt"
LocPromotionPopupText="<Bullet/> Deals electrical damage that pierces armour.<br/><Bullet/> Will not end the turn if this unit has the Rending Punch ability.<br/><Bullet/> Cannot be used from stealth.<br/><Bullet/> Can only chain to units friendly to the targeted unit.<br/><Bullet/> Has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[Unchained X2AbilityTemplate]
LocFriendlyName="Unchained"
LocLongDescription="The Chaining Jolt ability can now be used once per turn."
LocHelpText="The Chaining Jolt ability can now be used once per turn."
LocFlyOverText="Unchained"

[StrikeOut X2AbilityTemplate]
LocFriendlyName="Strike Out"
LocLongDescription="The Strike ability no longer has a cooldown."
LocHelpText="The Strike ability no longer has a cooldown."
LocFlyOverText="Strike Out"